{
  "name": "Pablo Ratache Rojas",
  "title": "Data Engineer & Software Developer",
  "portfolioUrl": "pr0nel.github.io/cv_pablo_ratache/",
  "githubProfileUrl": "https://github.com/Pr0nel",
  "about": {
    "summary": "Soy Pablo, Ingeniero Físico incursionando en la ingeniería de datos y desarrollo de software, apasionado por construir soluciones escalables y eficientes. Con una base sólida en almacenamiento de datos, procesos ETL y conceptos de programación, estoy deseando contribuir a proyectos innovadores y seguir creciendo profesionalmente.",
    "professionalProfile": "Como Data Engineer he demostrado habilidades clave con experiencia en el diseño y desarrollo de pipelines ETL/ELT utilizando tecnologías como GCP, AWS y Airflow, logrando reducciones significativas en los tiempos de carga (hasta 40 %) y automatizando ingestas delta y full-load. Además, he desplegado contenedores para ETL web-scrapping, lo que ha reducido la latencia en un 60 %. También he implementado soluciones de Machine Learning y Optical Character Recognition (OCR), alcanzando precisión del 90 % en tareas de segmentación (SAM) y extracción de texto (AWS Textract). Mi experiencia incluye la aplicación de metodologías ágiles como Scrum y el uso de métricas de eficiencia y estabilidad como OEE, Cp y Cpk en entornos industriales y procesos de análisis avanzado, incluyendo la gestión de calidad (QA/QC) bajo normativas ISO/IEC 17025 e INACAL.",
    "image": "assets/profile.png"
  },
  "contact": {
    "email": "pablo.ratache@uni.pe",
    "phone": "+51 966979127"
  },
  "education": [
    {
      "degree": "B.Sc. con mención en Ingeniería Física",
      "institution": "Universidad Nacional de Ingeniería, Rímac - Lima - Perú",
      "dates": "2010 - 2019",
      "details": "El proyecto final consistió en simular el consumo de energía para la calefacción de un Módulo de Vivienda Experimental ubicado a 4500 msnm. Las predicciones de temperatura se comparan con las temperaturas interiores registradas, para validar el modelo. A continuación, se calcula la temperatura interior objetivo. Finalmente, se calcula la energía necesaria para mantener una temperatura interior neutra."
    }
  ],
  "publications": [
    {
      "title": "Simulación del consumo energético para la calefacción de un módulo de vivienda experimental ubicado a 4500 msnm",
      "journal": "TECNIA",
      "date": "Jun 2021",
      "doiUrl": "https://doi.org/10.21754/tecnia.v21i1.1083"
    }
  ],
  "certifications": [],
  "languages": [
    { "language": "Español", "level": "Nativo", "progress": 100 },
    { "language": "Inglés", "level": "Intermedio", "progress": 50 }
  ],
  "experience": [
    {
      "role": "Jr. Data Engineer",
      "company": "Konexa-WOM [Chile] [Telecomunicaciones, B2C/B2B]",
      "dates": "Febrero 2025 - Actualidad",
      "description": "- Diseñé infraestructura de datos en GCP con Terraform y JSON.\n- Automatizé stored procedures y DAGs en Airflow, reduciendo tiempos de carga en 40 %.\n- Gestioné reprocesos de Oracle a BigQuery con 100 % de consistencia.\n- Desarrollé pipelines en AWS con PySpark para generar tablas finales escalables.\n- Desplegué contenedor Docker (Linux + PostgreSQL) para ETL web-scraping, normalizando registros y reduciendo latencia en 60 %.\n- Implementé arquitectura modular de ML (CLIP, OCR, segmentación, validación) alcanzando 90 % de precisión."
    },
    {
      "role": "Investigador de Producción",
      "company": "Productora De Alimentos Uno S.A.C. [Ate-Lima-Perú] [Alimentos Procesados, B2B]",
      "dates": "Mayo 2024 - Enero 2025",
      "description": "- Implementé KPIs de OEE para medir eficiencia en cuatro líneas de envasado.\n- Apliqué Cp y Cpk para evaluar variabilidad y estabilidad de procesos.\n- Transformé indicadores de planta en datasets estructurados (ETL, SQL Server).\n- Realicé la calibración de tanques y sensores, asegurando trazabilidad metrológica.\n- Definí límites de reproceso para optimizar fermentación y reducir mermas."
    },
    {
      "role": "Asistente de Calibraciones",
      "company": "Factio Qualitas S.A.C. [Surco-Lima-Perú] [Consultora Farmacéutica, B2B/B2C]",
      "dates": "Junio 2023 - Enero 2024",
      "description": "- Desarrollé un sistema de gestión, que centralizó clientes, equipos y certificados, con cloud storage y data governance, reduciendo el tiempo de atención en 60 %.\n- Analicé resultados aplicando decisiones basadas en datos (data-driven).\n- Coordiné con proveedores externos para calibración en campo.\n- Colaboré con QA/QC en la mejora del sistema de gestión del laboratorio.\n- Apoyé en documentación para acreditación ISO/IEC 17025."
    }
  ],
  "projects": [
    {
      "title": "Procesamiento de cupones con OCR y aprendizaje automático",
      "description": "Diseñé una aplicación Python que permite el proceso imágenes de vouchers (comprobantes o recibos) a través de un pipeline que incluye segmentación de los vouchers dentro de una imagen más grande, la validación si los segmentos son realmente vouchers y la extracción de texto mediante OCR.",
      "image": "assets/project1.png",
      "repositoryUrl": "https://github.com/Pr0nel/proyecto_ocr_vouchers"
    },
    {
      "title": "Análisis y Modelado de Datos para Predicción de Radiación Solar",
      "description": "Proyecto de análisis y modelado de datos para predecir la radiación solar horaria en un horizonte de tiempo determinado. Este proyecto involucra la exploración de datos, el preprocesamiento y limpieza de los mismos, y el entrenamiento de un modelo de aprendizaje automático para realizar la predicción.",
      "image": "assets/project2.png",
      "repositoryUrl": "https://github.com/Pr0nel/weather_data"
    },
    {
      "title": "Pipeline ETL/ELT: Ingesta y Normalización de Datos Web",
      "description": "Desarrollé un pipeline ETL/ELT para la ingesta de datos web (web-scraping), optimizando el proceso de extracción y normalización. Utilicé tecnologías como Python y PostgreSQL para la lógica de datos y Docker para la contenerización y despliegue en un entorno Linux. El proyecto logró normalizar registros diarios y reducir la latencia de procesamiento en un 60%.",
      "image": "assets/project3.png",
      "repositoryUrl": "https://github.com/Pr0nel/snippf-poc"
    }
  ],
  "skills": {
    "languages": [
      { "name": "C/C++", "level": 100 },
      { "name": "Python", "level": 90 },
      { "name": "SQL", "level": 90 },
      { "name": "PySpark", "level": 80 },
      { "name": "Bash", "level": 80 },
      { "name": "Java", "level": 70 },
      { "name": "HTML", "level": 65 },
      { "name": "CSS", "level": 65 },
      { "name": "JavaScript", "level": 65 }
    ],
    "tools": [
      {
        "name": "Herramientas de gestión de proyectos: Slack, Microsoft Teams, Trello, Jira, Confluence",
        "level": 100
      },
      {
        "name": "Control de versiones: Git, GitHub, GitLab, Bitbucket",
        "level": 100
      },
      {
        "name": "Cloud, CI/CD y Orquestación: GCP, AWS, Apache Airflow, Terraform (IaC)",
        "level": 80
      },
      {
        "name": "Herramientas de análisis y visualización de datos: Microsoft Excel, Power BI, Looker Studio",
        "level": 70
      },
      {
        "name": "Sistemas operativos: Linux, Windows",
        "level": 100
      },
      {
        "name": "Contenedores y Virtualización: Docker, Docker Compose",
        "level": 80
      },
      {
        "name": "Base de datos: PostgreSQL (Docker)",
        "level": 80
      }
    ],
    "concepts": [
      { "name": "Aprendizaje rápido", "level": 100 },
      { "name": "Planificación estratégica", "level": 100 },
      { "name": "Trabajo en equipo", "level": 100 },
      { "name": "Adaptabilidad", "level": 100 },
      { "name": "Pensamiento pragmático", "level": 100 },
      { "name": "Pensamiento abstracto", "level": 100 },
      { "name": "Escucha activa", "level": 100 },
      { "name": "Resolución de problemas", "level": 100 },
      { "name": "Gestión del tiempo", "level": 100 },
      { "name": "Gestión del cambio", "level": 100 },
      { "name": "Gestión de proyectos y metodologías ágiles: Scrum, Kanban, Design Thinking, enfoque Lean, PMBOK", "level": 100 },
      { "name": "Métricas de calidad y eficiencia: OEE, Cp, Cpk", "level": 100 },
      { "name": "QA/QC y Normativas: ISO/IEC 17025, INACAL", "level": 100 },
      { "name": "Data Warehousing", "level": 100 },
      { "name": "ETL Processes", "level": 100 },
      { "name": "Data Modeling", "level": 100 },
      { "name": "Analytics & Big Data", "level": 80 },
      { "name": "Cloud Computing (AWS/GCP)", "level": 80 },
      { "name": "Machine Learning & Computer Vision: CLIP, SAM, AWS Textract, OCR", "level": 80 }
    ]
  }  
}
